tikuos/tikuOS/arch/msp430/tiku_mpu_arch.c
/*
 * Tiku Operating System
 * http://tiku-os.org
 *
 * Authors: Ambuj Varshney <ambuj@tiku-os.org>
 *
 * tiku_mpu_arch.c - MSP430 MPU architecture implementation
 *
 * Implements the arch-level MPU register access for MSP430FR series.
 * All accesses to MPUCTL0 and MPUSAM go through this file, keeping
 * the password handling and hardware details in one place.
 *
 * The MSP430 MPU registers are password-protected: every write to
 * MPUCTL0 must include MPUPW (0xA500) in the upper byte. This
 * prevents wild pointer writes from accidentally modifying memory
 * protection configuration.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "tiku_mpu_arch.h"
#include "tiku_device_select.h"
#include "tiku_compiler.h"
#include <msp430.h>

/*---------------------------------------------------------------------------*/
/* MPU SEGMENT BOUNDARY SETUP                                                */
/*---------------------------------------------------------------------------*/

/*
 * The MPU needs valid segment boundaries before SAM permissions
 * have any effect. MPUSEGB1 and MPUSEGB2 divide the FRAM address
 * space into three segments. The register values are the actual
 * boundary addresses right-shifted by 4.
 */
void tiku_mpu_arch_init_segments(void)
{
    MPUCTL0  = MPUPW;                                  /* Unlock config */
    MPUSEGB1 = TIKU_DEVICE_MPU_SEG2_START >> 4;
    MPUSEGB2 = TIKU_DEVICE_MPU_SEG3_START >> 4;
    MPUCTL0  = MPUPW | MPUENA;                         /* Re-enable MPU */
}

/*---------------------------------------------------------------------------*/
/* MPU REGISTER ACCESS                                                       */
/*---------------------------------------------------------------------------*/

uint16_t tiku_mpu_arch_get_sam(void)
{
    return MPUSAM;
}

/*
 * Why unlock-write-enable in every set_sam call:
 *   The MPU config registers are locked by default. To modify MPUSAM
 *   we must write the password to MPUCTL0 first, then change MPUSAM,
 *   then write password | enable to MPUCTL0 to re-activate. Bundling
 *   this into set_sam means the kernel never needs to know about the
 *   password or the enable bit.
 *
 *   MPUSEGIE (violation NMI enable) is preserved across calls so that
 *   enabling violation detection is not accidentally undone by a later
 *   permission change.
 */
void tiku_mpu_arch_set_sam(uint16_t sam)
{
    uint16_t flags = MPUCTL0 & MPUSEGIE;  /* Preserve MPUSEGIE */
    MPUCTL0 = MPUPW;                       /* Unlock config */
    MPUSAM  = sam;                          /* Set permissions */
    MPUCTL0 = MPUPW | MPUENA | flags;     /* Re-enable + preserved flags */
}

uint16_t tiku_mpu_arch_get_ctl(void)
{
    return MPUCTL0;
}

void tiku_mpu_arch_disable_irq(void)
{
    __disable_interrupt();
}

void tiku_mpu_arch_enable_irq(void)
{
    __enable_interrupt();
}

/*---------------------------------------------------------------------------*/
/* MPU VIOLATION FLAGS                                                       */
/*---------------------------------------------------------------------------*/

/*
 * Software-latched violation flags. Reading SYSSNIV in the NMI ISR
 * clears the corresponding MPUCTL1 flag as a hardware side effect.
 * To let callers inspect which segment was violated, the ISR saves
 * MPUCTL1 here before acknowledging the interrupt.
 */
static volatile uint16_t latched_violation_flags;

uint16_t tiku_mpu_arch_get_ctl1(void)
{
    return latched_violation_flags;
}

void tiku_mpu_arch_clear_ctl1(void)
{
    latched_violation_flags = 0;
    MPUCTL0 = MPUPW;                        /* Unlock config */
    MPUCTL1 &= ~(MPUSEG1IFG | MPUSEG2IFG | MPUSEG3IFG);
    MPUCTL0 = MPUPW | MPUENA | MPUSEGIE;   /* Re-enable MPU + NMI */
}

void tiku_mpu_arch_enable_violation_nmi(void)
{
    MPUCTL0 = MPUPW | MPUENA | MPUSEGIE;
}

/*---------------------------------------------------------------------------*/
/* SYSNMI ISR — MPU VIOLATION HANDLER                                        */
/*---------------------------------------------------------------------------*/

/*
 * When MPUSEGIE is set, an MPU violation triggers a System NMI instead
 * of a PUC (reset). We latch MPUCTL1 before reading SYSSNIV because
 * the read clears the hardware violation flags. The latched value
 * can then be inspected by tiku_mpu_get_violation_flags().
 */
TIKU_ISR(SYSNMI_VECTOR, tiku_mpu_sysnmi_isr)
{
    latched_violation_flags |= MPUCTL1;
    (void)SYSSNIV;  /* Acknowledge NMI — clears hardware flags */
}
